xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2015 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        15. October 2015
 * $Revision:    V1.1
 *
 * Driver:       Driver_SAI1, Driver_SAI2
 * Configured:   via RTE_Device.h configuration file
 * Project:      SAI Driver for ST STM32F7xx
 * -----------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting               Value     SAI Interface
 *   ---------------------               -----     -------------
 *   Connect to hardware via Driver_SAI# = 1       use SAI1
 *   Connect to hardware via Driver_SAI# = 2       use SAI2
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.1
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *  Version 1.0
 *    - Initial release
 */

/*
 * NOTE:
 *  The SAI input clock must be properly configured in the user application
 */

#include "SAI_STM32F7xx.h"

#define ARM_SAI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,1)
// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SAI_API_VERSION, ARM_SAI_DRV_VERSION };


#ifdef MX_SAI1
#ifndef SAI1_RX_BLOCK
#define SAI1_RX_BLOCK SAI_BLOCK_A
#endif
#ifndef SAI1_TX_BLOCK
#define SAI1_TX_BLOCK SAI_BLOCK_B
#endif

#if ((SAI1_RX_BLOCK == SAI_BLOCK_A) && (SAI1_TX_BLOCK == SAI_BLOCK_A))
  #error "SAI1 BlockA can not be used for receive and also transmit."
#endif
#if ((SAI1_RX_BLOCK == SAI_BLOCK_B) && (SAI1_TX_BLOCK == SAI_BLOCK_B))
  #error "SAI1 BlockB can not be used for receive and also transmit."
#endif
#endif

#ifndef SAI1_SYNCOUT
#define SAI1_SYNCOUT   SAI_SYNCOUT_NO_SYNC
#endif

#ifndef SAI1_BLOCK_A_SYNC_SRC
#define SAI1_BLOCK_A_SYNC_SRC SAI_SYNC_SRC_INTERNAL_SUB_BLOCK
#endif

#ifndef SAI1_BLOCK_B_SYNC_SRC
#define SAI1_BLOCK_B_SYNC_SRC SAI_SYNC_SRC_INTERNAL_SUB_BLOCK
#endif

#ifdef MX_SAI2
#ifndef SAI2_RX_BLOCK
#define SAI2_RX_BLOCK SAI_BLOCK_A
#endif
#ifndef SAI2_TX_BLOCK
#define SAI2_TX_BLOCK SAI_BLOCK_B
#endif

#if ((SAI2_RX_BLOCK == SAI_BLOCK_A) && (SAI2_TX_BLOCK == SAI_BLOCK_A))
  #error "SAI2 BlockA can not be used for receive and also transmit."
#endif
#if ((SAI2_RX_BLOCK == SAI_BLOCK_B) && (SAI2_TX_BLOCK == SAI_BLOCK_B))
  #error "SAI2 BlockB can not be used for receive and also transmit."
#endif
#endif

#ifndef SAI2_SYNCOUT
#define SAI2_SYNCOUT   SAI_SYNCOUT_NO_SYNC
#endif

#ifndef SAI2_BLOCK_A_SYNC_SRC
#define SAI2_BLOCK_A_SYNC_SRC SAI_SYNC_SRC_INTERNAL_SUB_BLOCK
#endif

#ifndef SAI2_BLOCK_B_SYNC_SRC
#define SAI2_BLOCK_B_SYNC_SRC SAI_SYNC_SRC_INTERNAL_SUB_BLOCK
#endif

// SAI1
#ifdef MX_SAI1

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
SAI_HandleTypeDef hsai_BlockA1;
SAI_HandleTypeDef hsai_BlockB1;
#endif

// SAI1 Run-Time Information
static SAI_INFO        SAI1_Info = { 0U };
static SAI_STREAM_INFO SAI1_Stream_Info_A = { 0U };
static SAI_STREAM_INFO SAI1_Stream_Info_B = { 0U };

#ifdef MX_SAI1_SD_A_Pin
  static const SAI_PIN SAI1_sd_a   = {MX_SAI1_SD_A_GPIOx,   MX_SAI1_SD_A_GPIO_Pin,   MX_SAI1_SD_A_GPIO_AF};
#endif
#ifdef MX_SAI1_FS_A_Pin
  static const SAI_PIN SAI1_fs_a   = {MX_SAI1_FS_A_GPIOx,   MX_SAI1_FS_A_GPIO_Pin,   MX_SAI1_FS_A_GPIO_AF};
#endif
#ifdef MX_SAI1_SCK_A_Pin
  static const SAI_PIN SAI1_sck_a  = {MX_SAI1_SCK_A_GPIOx,  MX_SAI1_SCK_A_GPIO_Pin,  MX_SAI1_SCK_A_GPIO_AF};
#endif
#ifdef MX_SAI1_MCLK_A_Pin
  static const SAI_PIN SAI1_mclk_a = {MX_SAI1_MCLK_A_GPIOx, MX_SAI1_MCLK_A_GPIO_Pin, MX_SAI1_MCLK_A_GPIO_AF};
#endif
#ifdef MX_SAI1_SD_B_Pin
  static const SAI_PIN SAI1_sd_b   = {MX_SAI1_SD_B_GPIOx,   MX_SAI1_SD_B_GPIO_Pin,   MX_SAI1_SD_B_GPIO_AF};
#endif
#ifdef MX_SAI1_FS_B_Pin
  static const SAI_PIN SAI1_fs_b   = {MX_SAI1_FS_B_GPIOx,   MX_SAI1_FS_B_GPIO_Pin,   MX_SAI1_FS_B_GPIO_AF};
#endif
#ifdef MX_SAI1_SCK_B_Pin
  static const SAI_PIN SAI1_sck_b  = {MX_SAI1_SCK_B_GPIOx,  MX_SAI1_SCK_B_GPIO_Pin,  MX_SAI1_SCK_B_GPIO_AF};
#endif
#ifdef MX_SAI1_MCLK_B_Pin
  static const SAI_PIN SAI1_mclk_b = {MX_SAI1_MCLK_B_GPIOx, MX_SAI1_MCLK_B_GPIO_Pin, MX_SAI1_MCLK_B_GPIO_AF};
#endif

// SAI1 A DMA
#ifdef MX_SAI1_A_DMA_Instance
  void SAI1_A_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_sai1_a = { 0U };
#else
  extern DMA_HandleTypeDef hdma_sai1_a;
#endif
  static SAI_DMA SAI1_A_DMA = {
    &hdma_sai1_a,
    SAI1_A_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SAI1_A_DMA_Instance,
    MX_SAI1_A_DMA_Channel,
    MX_SAI1_A_DMA_Priority,
    MX_SAI1_A_DMA_IRQn
#endif
  };
#endif

// SAI1 B DMA
#ifdef MX_SAI1_B_DMA_Instance
  void SAI1_B_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_sai1_b = { 0U };
#else
  extern DMA_HandleTypeDef hdma_sai1_b;
#endif
  static SAI_DMA SAI1_B_DMA = {
    &hdma_sai1_b,
    SAI1_B_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SAI1_B_DMA_Instance,
    MX_SAI1_B_DMA_Channel,
    MX_SAI1_B_DMA_Priority,
    MX_SAI1_B_DMA_IRQn
#endif
  };
#endif

