xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
// SAI1 A Stream structure
static const SAI_STREAM sai1_stream_a = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hsai_BlockA1,                        // SAI HAL Handle
#endif
  SAI1_Block_A,                         // SAI block peripheral pointer
  {                                     // Pins
#ifdef MX_SAI1_SD_A_Pin
    &SAI1_sd_a,
#else
    NULL,
#endif
#ifdef MX_SAI1_FS_A_Pin
    &SAI1_fs_a,
#else
    NULL,
#endif
#ifdef MX_SAI1_SCK_A_Pin
    &SAI1_sck_a,
#else
    NULL,
#endif
#ifdef MX_SAI1_MCLK_A_Pin
    &SAI1_mclk_a,
#else
    NULL,
#endif
  },
#ifdef MX_SAI1_A_DMA_Instance
  &SAI1_A_DMA,
#else
  NULL,
#endif
  SAI1_BLOCK_A_SYNC_SRC,
  &SAI1_Stream_Info_A
};

// SAI1 B Stream structure
static const SAI_STREAM sai1_stream_b = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hsai_BlockB1,                        // SAI HAL Handle
#endif
  SAI1_Block_B,                         // SAI block peripheral pointer
  {                                     // Pins
#ifdef MX_SAI1_SD_B_Pin
    &SAI1_sd_b,
#else
    NULL,
#endif
#ifdef MX_SAI1_FS_B_Pin
    &SAI1_fs_b,
#else
    NULL,
#endif
#ifdef MX_SAI1_SCK_B_Pin
    &SAI1_sck_b,
#else
    NULL,
#endif
#ifdef MX_SAI1_MCLK_B_Pin
    &SAI1_mclk_b,
#else
    NULL,
#endif
  },
#ifdef MX_SAI1_B_DMA_Instance
  &SAI1_B_DMA,
#else
  NULL,
#endif
  SAI1_BLOCK_B_SYNC_SRC,
  &SAI1_Stream_Info_B
};

// SAI1 Resources
static const SAI_RESOURCES SAI1_Resources = {
  {  // Capabilities
    1,   ///< supports asynchronous Transmit/Receive
    1,   ///< supports synchronous Transmit/Receive
    1,   ///< supports user defined Protocol
    1,   ///< supports I2S Protocol
    1,   ///< supports MSB/LSB justified Protocol
    1,   ///< supports PCM short/long frame Protocol
    1,   ///< supports AC'97 Protocol
    1,   ///< supports Mono mode
    1,   ///< supports Companding
#if ((MX_SAI1_MCLK_A_Pin == 1U) || (RTE_SAI1_MCLK_B_PIN == 1U))
    1,   ///< supports MCLK (Master Clock) pin
#else
    0,   ///< supports MCLK (Master Clock) pin
#endif
    0,   ///< supports Frame error event: \ref ARM_SAI_EVENT_FRAME_ERROR
  },

  SAI1,
#if (SAI1_RX_BLOCK == SAI_BLOCK_A)
  &sai1_stream_a,
#else
  &sai1_stream_b,
#endif
#if (SAI1_TX_BLOCK == SAI_BLOCK_A)
  &sai1_stream_a,
#else
  &sai1_stream_b,
#endif

  RCC_PERIPHCLK_SAI1,
  SAI1_IRQn,
  SAI1_SYNCOUT,
  &SAI1_Info
};
#endif /* MX_SAI1 */

// SAI2
#ifdef MX_SAI2

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;
#endif

// SAI2 Run-Time Information
static SAI_INFO        SAI2_Info = { 0U };
static SAI_STREAM_INFO SAI2_Stream_Info_A = { 0U };
static SAI_STREAM_INFO SAI2_Stream_Info_B = { 0U };

#ifdef MX_SAI2_SD_A_Pin
  static const SAI_PIN SAI2_sd_a   = {MX_SAI2_SD_A_GPIOx,   MX_SAI2_SD_A_GPIO_Pin,   MX_SAI2_SD_A_GPIO_AF};
#endif
#ifdef MX_SAI2_FS_A_Pin
  static const SAI_PIN SAI2_fs_a   = {MX_SAI2_FS_A_GPIOx,   MX_SAI2_FS_A_GPIO_Pin,   MX_SAI2_FS_A_GPIO_AF};
#endif
#ifdef MX_SAI2_SCK_A_Pin
  static const SAI_PIN SAI2_sck_a  = {MX_SAI2_SCK_A_GPIOx,  MX_SAI2_SCK_A_GPIO_Pin,  MX_SAI2_SCK_A_GPIO_AF};
#endif
#ifdef MX_SAI2_MCLK_A_Pin
  static const SAI_PIN SAI2_mclk_a = {MX_SAI2_MCLK_A_GPIOx, MX_SAI2_MCLK_A_GPIO_Pin, MX_SAI2_MCLK_A_GPIO_AF};
#endif
#ifdef MX_SAI2_SD_B_Pin
  static const SAI_PIN SAI2_sd_b   = {MX_SAI2_SD_B_GPIOx,   MX_SAI2_SD_B_GPIO_Pin,   MX_SAI2_SD_B_GPIO_AF};
#endif
#ifdef MX_SAI2_FS_B_Pin
  static const SAI_PIN SAI2_fs_b   = {MX_SAI2_FS_B_GPIOx,   MX_SAI2_FS_B_GPIO_Pin,   MX_SAI2_FS_B_GPIO_AF};
#endif
#ifdef MX_SAI2_SCK_B_Pin
  static const SAI_PIN SAI2_sck_b  = {MX_SAI2_SCK_B_GPIOx,  MX_SAI2_SCK_B_GPIO_Pin,  MX_SAI2_SCK_B_GPIO_AF};
#endif
#ifdef MX_SAI2_MCLK_B_Pin
  static const SAI_PIN SAI2_mclk_b = {MX_SAI2_MCLK_B_GPIOx, MX_SAI2_MCLK_B_GPIO_Pin, MX_SAI2_MCLK_B_GPIO_AF};
#endif

// SAI2 A DMA
#ifdef MX_SAI2_A_DMA_Instance
  void SAI2_A_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_sai2_a = { 0U };
#else
  extern DMA_HandleTypeDef hdma_sai2_a;
#endif
  static SAI_DMA SAI2_A_DMA = {
    &hdma_sai2_a,
    SAI2_A_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SAI2_A_DMA_Instance,
    MX_SAI2_A_DMA_Channel,
    MX_SAI2_A_DMA_Priority,
    MX_SAI2_A_DMA_IRQn
#endif
  };
#endif

// SAI2 B DMA
#ifdef MX_SAI2_B_DMA_Instance
  void SAI2_B_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_sai2_b = { 0U };
#else
  extern DMA_HandleTypeDef hdma_sai2_b;
#endif
  static SAI_DMA SAI2_B_DMA = {
    &hdma_sai2_b,
    SAI2_B_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SAI2_B_DMA_Instance,
    MX_SAI2_B_DMA_Channel,
    MX_SAI2_B_DMA_Priority,
    MX_SAI2_B_DMA_IRQn
#endif
  };
#endif

// SAI2 A Stream structure
static const SAI_STREAM sai2_stream_a = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hsai_BlockA2,                        // SAI HAL Handle
#endif
  SAI2_Block_A,                         // SAI block peripheral pointer
  {                                     // Pins
#ifdef MX_SAI2_SD_A_Pin
    &SAI2_sd_a,
#else
    NULL,
#endif
#ifdef MX_SAI2_FS_A_Pin
    &SAI2_fs_a,
#else
    NULL,
#endif
#ifdef MX_SAI2_SCK_A_Pin
    &SAI2_sck_a,
#else
    NULL,
#endif
#ifdef MX_SAI2_MCLK_A_Pin
    &SAI2_mclk_a,
#else
    NULL,
#endif
  },
#ifdef MX_SAI2_A_DMA_Instance
  &SAI2_A_DMA,
#else
  NULL,
#endif
  SAI2_BLOCK_A_SYNC_SRC,
  &SAI2_Stream_Info_A
};

// SAI2 B Stream structure
static const SAI_STREAM sai2_stream_b = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hsai_BlockB2,                        // SAI HAL Handle
#endif
  SAI2_Block_B,                         // SAI block peripheral pointer
  {                                     // Pins
#ifdef MX_SAI2_SD_B_Pin
    &SAI2_sd_b,
#else
    NULL,
#endif
#ifdef MX_SAI2_FS_B_Pin
    &SAI2_fs_b,
#else
    NULL,
#endif
#ifdef MX_SAI2_SCK_B_Pin
    &SAI2_sck_b,
#else
    NULL,
#endif
#ifdef MX_SAI2_MCLK_B_Pin
    &SAI2_mclk_b,
#else
    NULL,
#endif
  },
#ifdef MX_SAI2_B_DMA_Instance
  &SAI2_B_DMA,
#else
  NULL,
#endif
  SAI2_BLOCK_B_SYNC_SRC,
  &SAI2_Stream_Info_B
};

