xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
// SAI2 Resources
static const SAI_RESOURCES SAI2_Resources = {
  {  // Capabilities
    1,   ///< supports asynchronous Transmit/Receive
    1,   ///< supports synchronous Transmit/Receive
    1,   ///< supports user defined Protocol
    1,   ///< supports I2S Protocol
    1,   ///< supports MSB/LSB justified Protocol
    1,   ///< supports PCM short/long frame Protocol
    1,   ///< supports AC'97 Protocol
    1,   ///< supports Mono mode
    1,   ///< supports Companding
#if ((MX_SAI2_MCLK_A_Pin == 1U) || (RTE_SAI2_MCLK_B_PIN == 1U))
    1,   ///< supports MCLK (Master Clock) pin
#else
    0,   ///< supports MCLK (Master Clock) pin
#endif
    0,   ///< supports Frame error event: \ref ARM_SAI_EVENT_FRAME_ERROR
  },

  SAI2,
#if (SAI2_RX_BLOCK == SAI_BLOCK_A)
  &sai2_stream_a,
#else
  &sai2_stream_b,
#endif
#if (SAI2_TX_BLOCK == SAI_BLOCK_A)
  &sai2_stream_a,
#else
  &sai2_stream_b,
#endif

  RCC_PERIPHCLK_SAI2,
  SAI2_IRQn,
  SAI2_SYNCOUT,
  &SAI2_Info
};
#endif /* MX_SAI2 */


#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
/**
  \fn          void Enable_GPIO_Clock (GPIO_TypeDef *port)
  \brief       Enable GPIO clock
*/
static void Enable_GPIO_Clock (GPIO_TypeDef *GPIOx) {
#ifdef GPIOA
  if (GPIOx == GPIOA) __GPIOA_CLK_ENABLE();
#endif 
#ifdef GPIOB
  if (GPIOx == GPIOB) __GPIOB_CLK_ENABLE();
#endif
#ifdef GPIOC
  if (GPIOx == GPIOC) __GPIOC_CLK_ENABLE();
#endif
#ifdef GPIOD
  if (GPIOx == GPIOD) __GPIOD_CLK_ENABLE();
#endif
#ifdef GPIOE
  if (GPIOx == GPIOE) __GPIOE_CLK_ENABLE();
#endif
#ifdef GPIOF
  if (GPIOx == GPIOF) __GPIOF_CLK_ENABLE();
#endif
#ifdef GPIOG
  if (GPIOx == GPIOG) __GPIOG_CLK_ENABLE();
#endif
#ifdef GPIOH
  if (GPIOx == GPIOH) __GPIOH_CLK_ENABLE();
#endif
#ifdef GPIOI
  if (GPIOx == GPIOI) __GPIOI_CLK_ENABLE();
#endif
#ifdef GPIOJ
  if (GPIOx == GPIOJ) __GPIOJ_CLK_ENABLE();
#endif
#ifdef GPIOK
  if (GPIOx == GPIOK) __GPIOK_CLK_ENABLE();
#endif
}
#endif


/**
  \fn          ARM_DRIVER_VERSION SAI_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION SAI_GetVersion (void) {
  return (DriverVersion);
}

/**
  \fn          ARM_SAI_CAPABILITIES SAI_GetCapabilities (SAI_RESOURCES *sai)
  \brief       Get driver capabilities.
  \param[in]   sai Pointer to SAI resources
  \return      \ref ARM_SAI_CAPABILITIES
*/
static ARM_SAI_CAPABILITIES SAI_GetCapabilities (SAI_RESOURCES *sai) {
  return (sai->capabilities);
}

/**
  \fn          int32_t SAI_Initialize (ARM_SAI_SignalEvent_t  cb_event,
                                       SAI_RESOURCES         *sai)
  \brief       Initialize SAI Interface.
  \param[in]   cb_event  Pointer to \ref ARM_SAI_SignalEvent
  \param[in]   sai       Pointer to SAI resources
  \return      \ref execution_status
*/
static int32_t SAI_Initialize (ARM_SAI_SignalEvent_t  cb_event,
                               SAI_RESOURCES         *sai) {
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  GPIO_InitTypeDef GPIO_InitStruct;
#endif

  if (sai->info->flags & SAI_FLAG_INITIALIZED) { return ARM_DRIVER_OK; }

  // Initialize SAI Run-Time Resources
  sai->info->cb_event = cb_event;
  sai->info->status.tx_busy      = 0U;
  sai->info->status.rx_busy      = 0U;
  sai->info->status.tx_underflow = 0U;
  sai->info->status.rx_overflow  = 0U;
  sai->info->status.frame_error  = 0U;

  // Clear stream information
  memset(sai->rx->info , 0, sizeof(SAI_STREAM_INFO));
  memset(sai->tx->info , 0, sizeof(SAI_STREAM_INFO));

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  // Configure RX SD pin
  if (sai->rx->io.sd != NULL) {
    Enable_GPIO_Clock (sai->rx->io.sd->port);
    GPIO_InitStruct.Pin       = sai->rx->io.sd->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->rx->io.sd->af;
    HAL_GPIO_Init(sai->rx->io.sd->port, &GPIO_InitStruct);
  }

  // Configure RX FS pin
  if (sai->rx->io.fs != NULL) {
    Enable_GPIO_Clock (sai->rx->io.fs->port);
    GPIO_InitStruct.Pin       = sai->rx->io.fs->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->rx->io.fs->af;
    HAL_GPIO_Init(sai->rx->io.fs->port, &GPIO_InitStruct);
  }

  // Configure RX SCK pin
  if (sai->rx->io.sck != NULL) {
    Enable_GPIO_Clock (sai->rx->io.sck->port);
    GPIO_InitStruct.Pin       = sai->rx->io.sck->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->rx->io.sck->af;
    HAL_GPIO_Init(sai->rx->io.sck->port, &GPIO_InitStruct);
  }

    // Configure RX MCLK pin
  if (sai->rx->io.mclk != NULL) {
    Enable_GPIO_Clock (sai->rx->io.mclk->port);
    GPIO_InitStruct.Pin       = sai->rx->io.mclk->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->rx->io.mclk->af;
    HAL_GPIO_Init(sai->rx->io.mclk->port, &GPIO_InitStruct);
  }

  // Configure TX SD pin
  if (sai->tx->io.sd != NULL) {
    Enable_GPIO_Clock (sai->tx->io.sd->port);
    GPIO_InitStruct.Pin       = sai->tx->io.sd->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->tx->io.sd->af;
    HAL_GPIO_Init(sai->tx->io.sd->port, &GPIO_InitStruct);
  }

  // Configure TX FS pin
  if (sai->tx->io.fs != NULL) {
    Enable_GPIO_Clock (sai->tx->io.fs->port);
    GPIO_InitStruct.Pin       = sai->tx->io.fs->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->tx->io.fs->af;
    HAL_GPIO_Init(sai->tx->io.fs->port, &GPIO_InitStruct);
  }

  // Configure TX SCK pin
  if (sai->tx->io.sck != NULL) {
    Enable_GPIO_Clock (sai->tx->io.sck->port);
    GPIO_InitStruct.Pin       = sai->tx->io.sck->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->tx->io.sck->af;
    HAL_GPIO_Init(sai->tx->io.sck->port, &GPIO_InitStruct);
  }

    // Configure TX MCLK pin
  if (sai->tx->io.mclk != NULL) {
    Enable_GPIO_Clock (sai->tx->io.mclk->port);
    GPIO_InitStruct.Pin       = sai->tx->io.mclk->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = sai->tx->io.mclk->af;
    HAL_GPIO_Init(sai->tx->io.mclk->port, &GPIO_InitStruct);
  }

#ifdef __SAI_DMA
  if ((sai->rx->dma != NULL) || (sai->tx->dma != NULL)) {

    if (sai->rx->dma != NULL) {
      // Initialize SAI RX DMA Resources
      sai->rx->dma->hdma->Instance             = sai->rx->dma->stream;
      sai->rx->dma->hdma->Init.Channel         = sai->rx->dma->channel;
      sai->rx->dma->hdma->Init.Direction       = DMA_PERIPH_TO_MEMORY;
      sai->rx->dma->hdma->Init.Mode            = DMA_NORMAL;
      sai->rx->dma->hdma->Init.Priority        = sai->rx->dma->priority;
      sai->rx->dma->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
      sai->rx->dma->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
      sai->rx->dma->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
      sai->rx->dma->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
      sai->rx->dma->hdma->Parent               = NULL;
      sai->rx->dma->hdma->XferCpltCallback     = sai->rx->dma->cb_complete;
      sai->rx->dma->hdma->XferHalfCpltCallback = NULL;
      sai->rx->dma->hdma->XferM1CpltCallback   = NULL;
      sai->rx->dma->hdma->XferErrorCallback    = NULL;
    }

    if (sai->tx->dma != NULL) {
      // Initialize SAI TX DMA Resources
      sai->tx->dma->hdma->Instance             = sai->tx->dma->stream;
      sai->tx->dma->hdma->Init.Channel         = sai->tx->dma->channel;
      sai->tx->dma->hdma->Init.Direction       = DMA_MEMORY_TO_PERIPH;
      sai->tx->dma->hdma->Init.PeriphInc       = DMA_PINC_DISABLE;
      sai->tx->dma->hdma->Init.MemInc          = DMA_MINC_ENABLE;
      sai->tx->dma->hdma->Init.Mode            = DMA_NORMAL;
      sai->tx->dma->hdma->Init.Priority        = sai->tx->dma->priority;
      sai->tx->dma->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
      sai->tx->dma->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
      sai->tx->dma->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
      sai->tx->dma->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
      sai->tx->dma->hdma->Parent               = NULL;
      sai->tx->dma->hdma->XferCpltCallback     = sai->tx->dma->cb_complete;
      sai->tx->dma->hdma->XferHalfCpltCallback = NULL;
      sai->tx->dma->hdma->XferM1CpltCallback   = NULL;
      sai->tx->dma->hdma->XferErrorCallback    = NULL;
    }

