xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
    __DMA2_CLK_ENABLE();
  }
#endif
#else
  sai->rx->h->Instance = sai->rx->reg;
  sai->tx->h->Instance = sai->tx->reg;

  if (sai->rx->dma != NULL) {
    sai->rx->dma->hdma->XferCpltCallback = sai->rx->dma->cb_complete;
  }
  if (sai->tx->dma != NULL) {
    sai->tx->dma->hdma->XferCpltCallback = sai->tx->dma->cb_complete;
  }
#endif

  sai->info->flags = SAI_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;

}

/**
  \fn          int32_t SAI_Uninitialize (SAI_RESOURCES *sai)
  \brief       De-initialize SAI Interface.
  \param[in]   sai  Pointer to SAI resources
  \return      \ref execution_status
*/
static int32_t SAI_Uninitialize (SAI_RESOURCES *sai) {
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  // Unconfigure SAI pins
  if (sai->rx->io.sd   != NULL) { HAL_GPIO_DeInit(sai->rx->io.sd->port,   sai->rx->io.sd->pin);   }
  if (sai->rx->io.fs   != NULL) { HAL_GPIO_DeInit(sai->rx->io.fs->port,   sai->rx->io.fs->pin);   }
  if (sai->rx->io.sck  != NULL) { HAL_GPIO_DeInit(sai->rx->io.sck->port,  sai->rx->io.sck->pin);  }
  if (sai->rx->io.mclk != NULL) { HAL_GPIO_DeInit(sai->rx->io.mclk->port, sai->rx->io.mclk->pin); }
  if (sai->tx->io.sd   != NULL) { HAL_GPIO_DeInit(sai->tx->io.sd->port,   sai->tx->io.sd->pin);   }
  if (sai->tx->io.fs   != NULL) { HAL_GPIO_DeInit(sai->tx->io.fs->port,   sai->tx->io.fs->pin);   }
  if (sai->tx->io.sck  != NULL) { HAL_GPIO_DeInit(sai->tx->io.sck->port,  sai->tx->io.sck->pin);  }
  if (sai->tx->io.mclk != NULL) { HAL_GPIO_DeInit(sai->tx->io.mclk->port, sai->tx->io.mclk->pin); }

  if (sai->rx->dma     != NULL) { sai->rx->dma->hdma->Instance = NULL; }
  if (sai->tx->dma     != NULL) { sai->tx->dma->hdma->Instance = NULL; }
#else
  sai->rx->h->Instance  = NULL;
  sai->tx->h->Instance  = NULL;
#endif

  // Clear SAI flags
  sai->info->flags = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SAI_PowerControl (ARM_POWER_STATE  state,
                                         SAI_RESOURCES   *sai)
  \brief       Control SAI Interface Power.
  \param[in]   state  Power state
  \param[in]   sai    Pointer to SAI resources
  \return      \ref execution_status
*/
static int32_t SAI_PowerControl (ARM_POWER_STATE  state,
                                 SAI_RESOURCES   *sai) {
  switch (state) {
    case ARM_POWER_OFF:
      // SAI peripheral reset
      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_FORCE_RESET(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_FORCE_RESET(); }

      __NOP(); __NOP(); __NOP(); __NOP();

      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_RELEASE_RESET(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_RELEASE_RESET(); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      HAL_NVIC_DisableIRQ (sai->irq_num);
#ifdef __SAI_DMA
      if (sai->rx->dma != NULL) {
        if (sai->rx->dma->hdma->Instance != NULL) {
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ (sai->rx->dma->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (sai->rx->dma->hdma);
        }
      }

      if (sai->tx->dma != NULL) {
        if (sai->tx->dma->hdma->Instance != NULL) {
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ (sai->tx->dma->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (sai->tx->dma->hdma);
        }
      }
#endif
#else
      if (sai->rx->h->Instance != NULL) { HAL_SAI_MspDeInit (sai->rx->h); }
      if (sai->tx->h->Instance != NULL) { HAL_SAI_MspDeInit (sai->tx->h); }
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Disable SAI clock
      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_CLK_DISABLE(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_CLK_DISABLE(); }
#endif

      // Clear status flags
      sai->info->status.tx_busy      = 0U;
      sai->info->status.rx_busy      = 0U;
      sai->info->status.tx_underflow = 0U;
      sai->info->status.rx_overflow  = 0U;
      sai->info->status.frame_error  = 0U;

      // Clear powered flag
      sai->info->flags = SAI_FLAG_INITIALIZED;
      break;

    case ARM_POWER_FULL:
      // Check if SAI already powered
      if (sai->info->flags & SAI_FLAG_POWERED) { return ARM_DRIVER_OK; }

      // Clear status flags
      sai->info->status.tx_busy      = 0U;
      sai->info->status.rx_busy      = 0U;
      sai->info->status.tx_underflow = 0U;
      sai->info->status.rx_overflow  = 0U;
      sai->info->status.frame_error  = 0U;

      // Clear stream information
      memset(sai->rx->info , 0, sizeof(SAI_STREAM_INFO));
      memset(sai->tx->info , 0, sizeof(SAI_STREAM_INFO));

      // Ready for operation - set powered flag
      sai->info->flags |= SAI_FLAG_POWERED;

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Enable SAI clock
      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_CLK_ENABLE(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_CLK_ENABLE(); }

      // Clear and Enable SAI IRQ
      NVIC_ClearPendingIRQ(sai->irq_num);
      NVIC_EnableIRQ(sai->irq_num);

#ifdef __SAI_DMA
      if (sai->rx->dma != NULL) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ(sai->rx->dma->irq_num);
        NVIC_EnableIRQ(sai->rx->dma->irq_num);
      }

      if (sai->tx->dma != NULL) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ(sai->tx->dma->irq_num);
        NVIC_EnableIRQ(sai->tx->dma->irq_num);
      }
#endif
#else
      HAL_SAI_MspInit (sai->rx->h);
      HAL_SAI_MspInit (sai->tx->h);
#endif

      // SAI peripheral reset
      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_FORCE_RESET(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_FORCE_RESET(); }

      __NOP(); __NOP(); __NOP(); __NOP();

      if      (sai->reg == SAI1) { __HAL_RCC_SAI1_RELEASE_RESET(); }
      else if (sai->reg == SAI2) { __HAL_RCC_SAI2_RELEASE_RESET(); }

      // Synchronization output
      sai->reg->GCR = sai->sync_out << 4;

      // Synchronization input
      if (sai->reg == SAI1) { sai->reg->GCR |= 0x02U; }
      if (sai->reg == SAI2) { sai->reg->GCR |= 0x01U; }

      // Activate all slots (default)
      sai->rx->reg->SLOTR = 0xFFFF0F00U;
      sai->tx->reg->SLOTR = 0xFFFF0F00U;

      break;

    case ARM_POWER_LOW:
    default: return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;

