xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
}

/**
  \fn          int32_t SAI_Send (const void *data, uint32_t num, SAI_RESOURCES *sai)
  \brief       Start sending data to SAI transmitter.
  \param[in]   data  Pointer to buffer with data to send to SAI transmitter
  \param[in]   num   Number of data items to send
  \param[in]   sai   Pointer to SAI resources
  \return      \ref execution_status
*/
static int32_t SAI_Send (const void *data, uint32_t num, SAI_RESOURCES *sai) {

  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((sai->info->flags & SAI_FLAG_CONFIGURED) == 0U) {
    // SAI is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (sai->info->status.tx_busy) {
    // Send is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set Send busy flag
  sai->info->status.tx_busy = 1U;

  // Clear TX underflow flag
  sai->info->status.tx_underflow = 0U;

  // Save transmit buffer info
  sai->tx->info->buf = (uint8_t *)data;
  sai->tx->info->cnt = 0U;
  sai->tx->info->num = num;

  // DMA mode
#ifdef __SAI_DMA
  if (sai->tx->dma != NULL) {
    if (sai->tx->info->data_bits > 16U) {
      sai->tx->dma->hdma->Init.PeriphDataAlignment   = DMA_PDATAALIGN_WORD;
      sai->tx->dma->hdma->Init.MemDataAlignment      = DMA_PDATAALIGN_WORD;
    } else {
      if (sai->tx->info->data_bits > 8U) {
        sai->tx->dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        sai->tx->dma->hdma->Init.MemDataAlignment    = DMA_PDATAALIGN_HALFWORD;
      } else {
        sai->tx->dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        sai->tx->dma->hdma->Init.MemDataAlignment    = DMA_PDATAALIGN_BYTE;
      }
    }

    // Initialize and start SAI TX DMA Stream
    if (HAL_DMA_Init     (sai->tx->dma->hdma) != HAL_OK) { return ARM_DRIVER_ERROR; }
    if (HAL_DMA_Start_IT (sai->tx->dma->hdma, (uint32_t)sai->tx->info->buf, (uint32_t)(&sai->tx->reg->DR), num) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    // DMA enable
    sai->tx->reg->CR1 |= SAI_xCR1_DMAEN;
  } else
#endif
  {
    // FIFO request interrupt enable
    sai->tx->reg->IMR |= SAI_xIMR_FREQIE;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SAI_Receive (void *data, uint32_t num, SAI_RESOURCES *sai)
  \brief       Start receiving data from SAI receiver.
  \param[out]  data  Pointer to buffer for data to receive from SAI receiver
  \param[in]   num   Number of data items to receive
  \param[in]   sai   Pointer to SAI resources
  \return      \ref execution_status
*/
static int32_t SAI_Receive (void *data, uint32_t num, SAI_RESOURCES *sai) {

  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((sai->info->flags & SAI_FLAG_CONFIGURED) == 0U) {
    // SAI is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (sai->info->status.rx_busy) {
    // Receive is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set receive active flag
  sai->info->status.rx_busy = 1U;

  // Clear RX overflow flag
  sai->info->status.rx_overflow = 0U;

  // Save transmit buffer info
  sai->rx->info->buf = (uint8_t *)data;
  sai->rx->info->cnt = 0U;
  sai->rx->info->num = num;

  // DMA mode
#ifdef __SAI_DMA
  if (sai->rx->dma != NULL) {
    if (sai->rx->info->data_bits > 16U) {
      sai->rx->dma->hdma->Init.PeriphDataAlignment   = DMA_PDATAALIGN_WORD;
      sai->rx->dma->hdma->Init.MemDataAlignment      = DMA_PDATAALIGN_WORD;
    } else {
      if (sai->rx->info->data_bits > 8U) {
        sai->rx->dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        sai->rx->dma->hdma->Init.MemDataAlignment    = DMA_PDATAALIGN_HALFWORD;
      } else {
        sai->rx->dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        sai->rx->dma->hdma->Init.MemDataAlignment    = DMA_PDATAALIGN_BYTE;
      }
    }

    // Initialize and start SAI RX DMA Stream
    if (HAL_DMA_Init     (sai->rx->dma->hdma) != HAL_OK) { return ARM_DRIVER_ERROR; }
    if (HAL_DMA_Start_IT (sai->rx->dma->hdma, (uint32_t)(&sai->rx->reg->DR), (uint32_t)sai->rx->info->buf, num) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    // DMA enable
    sai->rx->reg->CR1 |= SAI_xCR1_DMAEN;
  } else
#endif
  {
    // FIFO request interrupt enable
    sai->rx->reg->IMR |= SAI_xIMR_FREQIE;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t SAI_GetTxCount (SAI_RESOURCES *sai)
  \brief       Get transmitted data count.
  \param[in]   sai  Pointer to SAI resources
  \return      number of data items transmitted
*/
static uint32_t SAI_GetTxCount (SAI_RESOURCES *sai) {
#ifdef __SAI_DMA
  if (sai->tx->dma != NULL) {
    return (sai->tx->info->num - __HAL_DMA_GET_COUNTER(sai->tx->dma->hdma));
  } else
#endif
  {
    return sai->tx->info->cnt;
  }
}

/**
  \fn          uint32_t ARM_SAI_GetRxCount (SAI_RESOURCES *sai)
  \brief       Get received data count.
  \param[in]   sai  Pointer to SAI resources
  \return      number of data items received
*/
static uint32_t SAI_GetRxCount (SAI_RESOURCES *sai) {
#ifdef __SAI_DMA
  if (sai->rx->dma != NULL) {
    return (sai->rx->info->num - __HAL_DMA_GET_COUNTER(sai->rx->dma->hdma));
  } else
#endif
  {
    return sai->rx->info->cnt;
  }
}

/**
  \fn          int32_t SAI_Control (uint32_t control, uint32_t arg1, uint32_t arg2, SAI_RESOURCES *sai)
  \brief       Control SAI Interface.
  \param[in]   control  Operation
  \param[in]   arg1     Argument 1 of operation (optional)
  \param[in]   arg2     Argument 2 of operation (optional)
  \param[in]   sai      Pointer to SAI resources
  \return      common \ref execution_status and driver specific \ref sai_execution_status
*/
static int32_t SAI_Control (uint32_t control, uint32_t arg1, uint32_t arg2, SAI_RESOURCES *sai) {
  uint8_t  master, mclk_pin, stream_en;
  uint32_t i, val, freq;
  uint32_t cr1, cr2, slotr, frcr;
  uint32_t frame_len, frame_sync_width, frame_sync_pol;
  uint32_t bit_order, clock_pol, frame_sync_early, slot_count, slot_sz, slot_offset; 
  SAI_STREAM * stream;

