xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
  if ((sai->info->flags & SAI_FLAG_POWERED) == 0U) {
    // SAI not powered
    return ARM_DRIVER_ERROR;
  }

  // Clear lokal register variables
  cr1 = cr2 = slotr = frcr = 0U;

  switch (control & ARM_SAI_CONTROL_Msk) {
    case ARM_SAI_CONFIGURE_TX:
      stream = sai->tx;
      break;

    case ARM_SAI_CONFIGURE_RX:
      stream = sai->rx;
      break;

    case ARM_SAI_CONTROL_TX:
      stream = sai->tx;
      // Check mute bit
      if ((arg1 & 2U) != 0U) { stream->reg->CR2 |=  SAI_xCR2_MUTE; }
      else                   { stream->reg->CR2 &= ~SAI_xCR2_MUTE; }

      if ((arg1 & 1U) == 0U) {
        // Disable transmitter
        stream->reg->CR1 &= ~SAI_xCR1_SAIEN;
      } else {
        // Enable transmitter
        stream->reg->CR1 |=  SAI_xCR1_SAIEN;

        // Enable transmit underflow interrupt
        stream->reg->IMR |= SAI_xIMR_OVRUDRIE;
      }

      return ARM_DRIVER_OK;

    case ARM_SAI_CONTROL_RX:
      stream = sai->rx;
      if ((arg1 & 1U) == 0U) {
        // Disable receiver
        stream->reg->CR1 &= ~SAI_xCR1_SAIEN;
      } else {
        // Enable receiver
        stream->reg->CR1 |=  SAI_xCR1_SAIEN;

        // Enable receive overflow interrupt
        stream->reg->IMR |= SAI_xIMR_OVRUDRIE;
      }
      return ARM_DRIVER_OK;

    case ARM_SAI_MASK_SLOTS_TX:
      stream = sai->tx;
      if (stream->info->protocol != ARM_SAI_PROTOCOL_USER) { return ARM_DRIVER_ERROR; }

      arg1 =~ arg1;

      // Max slot number is 16
      if ((arg1 & 0xFFFF0000) != 0U) { return ARM_DRIVER_ERROR; }

      // Get number of masked slots
      val = 0;
      for (i = 1; i < 0x10000U; i <<= 1) {
        if (arg1 & i) { val++; }
      }

      slotr &= ~(SAI_xSLOTR_NBSLOT | SAI_xSLOTR_SLOTEN);
      slotr |=  ((arg1 << 16) | (val << 8));

      if (stream->reg->CR1 & SAI_xCR1_SAIEN) {
        stream_en = 1U;
        // Disable SAI block
        stream->reg->CR1 &= ~SAI_xCR1_SAIEN;
      } else {
        stream_en = 0U;
      }

      stream->reg->SLOTR = slotr;

      if (stream_en == 1U) { stream->reg->CR1 |= SAI_xCR1_SAIEN; }

      return ARM_DRIVER_OK;
    case ARM_SAI_MASK_SLOTS_RX:
      stream = sai->rx;
      if (stream->info->protocol != ARM_SAI_PROTOCOL_USER) { return ARM_DRIVER_ERROR; }

      arg1 =~ arg1;

      // Max slot number is 16
      if ((arg1 & 0xFFFF0000) != 0U) { return ARM_DRIVER_ERROR; }

      // Get number of masked slots
      val = 0;
      for (i = 1; i < 0x10000U; i <<= 1) {
        if (arg1 & i) { val++; }
      }

      slotr &= ~(SAI_xSLOTR_NBSLOT | SAI_xSLOTR_SLOTEN);
      slotr |=  ((arg1 << 16) | (val << 8));

      if (stream->reg->CR1 & SAI_xCR1_SAIEN) {
        stream_en = 1U;
        // Disable SAI block
        stream->reg->CR1 &= ~SAI_xCR1_SAIEN;
      } else {
        stream_en = 0U;
      }

      stream->reg->SLOTR = slotr;

      if (stream_en == 1U) { stream->reg->CR1 |= SAI_xCR1_SAIEN; }

      return ARM_DRIVER_OK;

    case ARM_SAI_ABORT_SEND:
      stream = sai->tx;
      // Disable FIFO request interrupt
      stream->reg->IMR &= ~SAI_xIMR_FREQIE;

      // Disable DMA channel
#ifdef __SAI_DMA
      // Disable DMA
      stream->reg->CR1 &= ~(SAI_xCR1_DMAEN);

      // If DMA mode - disable DMA channel
      if (stream->dma != NULL) {
        HAL_DMA_Abort (stream->dma->hdma);
      }
#endif

      // Flush TX FIFO
      stream->reg->CR2 |= SAI_xCR2_FFLUSH;

      // Reset counters
      stream->info->cnt = 0U;
      stream->info->num = 0U;

      // Clear busy flag
      sai->info->status.tx_busy = 0U;

      return ARM_DRIVER_OK;

    case ARM_SAI_ABORT_RECEIVE:
      stream = sai->rx;
      // Disable FIFO request interrupt
      stream->reg->IMR &= ~SAI_xIMR_FREQIE;

      // Disable DMA channel
#ifdef __SAI_DMA
      // Disable DMA
      stream->reg->CR1 &= ~(SAI_xCR1_DMAEN);

      // If DMA mode - disable DMA channel
      if (stream->dma != NULL) {
        HAL_DMA_Abort (stream->dma->hdma);
      }
#endif

      // Flush RX FIFO
      stream->reg->CR2 |= SAI_xCR2_FFLUSH;

      // Reset counters
      stream->info->cnt = 0U;
      stream->info->num = 0U;

      // Clear busy flag
      sai->info->status.rx_busy = 0U;
      return ARM_DRIVER_OK;

    default: return ARM_DRIVER_ERROR;
  }

  // Mode
  switch (control & ARM_SAI_MODE_Msk) {
    case ARM_SAI_MODE_MASTER:
      master = 1U;
      if ((control & ARM_SAI_CONTROL_Msk) == ARM_SAI_CONFIGURE_RX) {
        // Master receiver
        cr1 |= SAI_xCR1_MODE_0;
      }
      break;
    case ARM_SAI_MODE_SLAVE:
      master = 0U;
      if ((control & ARM_SAI_CONTROL_Msk) == ARM_SAI_CONFIGURE_TX) {
        // Slave transmitter
        cr1 |= SAI_xCR1_MODE_1;
      } else {
        // Slave receiver
        cr1 |= SAI_xCR1_MODE;
      }
      break;
    default: return ARM_DRIVER_ERROR;
  }

  // Synchronization
  switch (control & ARM_SAI_SYNCHRONIZATION_Msk) {
    case ARM_SAI_ASYNCHRONOUS:
      // Stream in asynchronous mode
      break;
    case ARM_SAI_SYNCHRONOUS:
      if (stream->sync_source == SAI_SYNC_SRC_INTERNAL_SUB_BLOCK) {
        // Stream synchronous with the other internal sub-block
        cr1 |= SAI_xCR1_SYNCEN_0;
      } else {
        // Stream synchronous with an external SAI emmbedded peripheral
        cr1 |= SAI_xCR1_SYNCEN_1;
      }
      break;
    default: return ARM_SAI_ERROR_SYNCHRONIZATION;
  }

  // Get Data size
  stream->info->data_bits = ((control & ARM_SAI_DATA_SIZE_Msk) >> ARM_SAI_DATA_SIZE_Pos) + 1;
  switch (stream->info->data_bits) {
    case 8:  cr1 |= (2U << 5); break;
    case 10: cr1 |= (3U << 5); break;
    case 16: cr1 |= (4U << 5); break;
    case 20: cr1 |= (5U << 5); break;
    case 24: cr1 |= (6U << 5); break;
    case 32: cr1 |= (7U << 5); break;
    default: return ARM_SAI_ERROR_DATA_SIZE;
  }

  // Get Bit Order
  bit_order = control & ARM_SAI_BIT_ORDER_Msk;

  // Clock polarity
  clock_pol = control & ARM_SAI_CLOCK_POLARITY_Msk;

  // Get Frame length
  frame_len = ((arg1 & ARM_SAI_FRAME_LENGTH_Msk) >> ARM_SAI_FRAME_LENGTH_Pos) + 1U;
  // Check if default value
  if (frame_len == 1U) { frame_len = 0U; }

  // Get Slot size
  switch (arg1 & ARM_SAI_SLOT_SIZE_Msk) {
    case ARM_SAI_SLOT_SIZE_DEFAULT: slot_sz = stream->info->data_bits; break;
    case ARM_SAI_SLOT_SIZE_16:      slot_sz = 16;                      break;
    case ARM_SAI_SLOT_SIZE_32:      slot_sz = 32;                      break;
    default: return ARM_SAI_ERROR_SLOT_SIZE;
  }

  if (slot_sz < stream->info->data_bits) {return ARM_SAI_ERROR_SLOT_SIZE; }

