xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
  // Get Agument1 values
  frame_sync_width = ((arg1 & ARM_SAI_FRAME_SYNC_WIDTH_Msk) >> ARM_SAI_FRAME_SYNC_WIDTH_Pos) + 1;
  frame_sync_pol   =   arg1 & ARM_SAI_FRAME_SYNC_POLARITY_Msk;
  frame_sync_early = ((arg1 & ARM_SAI_FRAME_SYNC_EARLY) == 0) ? false : true;
  slot_count       = ((arg1 & ARM_SAI_SLOT_COUNT_Msk) >> ARM_SAI_SLOT_COUNT_Pos) + 1;
  slot_offset      =  (arg1 & ARM_SAI_SLOT_OFFSET_Msk) >> ARM_SAI_SLOT_OFFSET_Pos;

  // Protocol
  stream->info->protocol = control & ARM_SAI_PROTOCOL_Msk;

  switch (stream->info->protocol) {
    // User Protocol
    case ARM_SAI_PROTOCOL_USER:
      if (frame_len < 8U)     { return ARM_SAI_ERROR_FRAME_LENGHT; }
      if (frame_len > 1024U)  { return ARM_SAI_ERROR_FRAME_LENGHT; }

      if (slot_offset > (slot_sz - stream->info->data_bits)) { 
        return ARM_SAI_ERROR_SLOT_OFFESET;
      }
      break;

    // I2S
    case ARM_SAI_PROTOCOL_I2S:
      if (clock_pol != ARM_SAI_CLOCK_POLARITY_0) {
        return ARM_SAI_ERROR_CLOCK_POLARITY;
      }
      if (frame_len == 0U) {
        frame_len = stream->info->data_bits * 2U;
      } else {
        if (frame_len != (stream->info->data_bits * 2U)) { return ARM_SAI_ERROR_FRAME_LENGHT; }
      }

      bit_order        = ARM_SAI_MSB_FIRST;
      frame_sync_width = frame_len / 2U;
      frame_sync_pol   = ARM_SAI_FRAME_SYNC_POLARITY_LOW;
      frame_sync_early = true;
      slot_count       = 2U;
      slot_sz          = stream->info->data_bits;
      slot_offset      = 0U;
      break;

    // MSB Justified
    case ARM_SAI_PROTOCOL_MSB_JUSTIFIED:
      if (clock_pol != ARM_SAI_CLOCK_POLARITY_0) {
        return ARM_SAI_ERROR_CLOCK_POLARITY;
      }
      if (frame_len == 0U) {
        frame_len = slot_sz * 2U;
      } else {
        if (frame_len != (slot_sz * 2)) {
          return ARM_SAI_ERROR_FRAME_LENGHT;
        }
      }

      bit_order        = ARM_SAI_MSB_FIRST;
      frame_sync_width = frame_len / 2U;
      frame_sync_pol   = ARM_SAI_FRAME_SYNC_POLARITY_HIGH;
      frame_sync_early = false;
      slot_count       = 2U;
      slot_offset      = 0U;
      break;

    // LSB Justified
    case ARM_SAI_PROTOCOL_LSB_JUSTIFIED:
      if (clock_pol != ARM_SAI_CLOCK_POLARITY_0) {
        return ARM_SAI_ERROR_CLOCK_POLARITY;
      }
      if (frame_len == 0U) {
        frame_len = slot_sz * 2U;
      } else {
        if (frame_len != (slot_sz * 2)) {
          return ARM_SAI_ERROR_FRAME_LENGHT;
        }
      }

      bit_order        = ARM_SAI_MSB_FIRST;
      frame_sync_width = frame_len / 2U;
      frame_sync_pol   = ARM_SAI_FRAME_SYNC_POLARITY_HIGH;
      frame_sync_early = false;
      slot_count       = 2U;
      slot_offset      = slot_sz - stream->info->data_bits;
      break;

    // PCM Short
    case ARM_SAI_PROTOCOL_PCM_SHORT:
      if (clock_pol != ARM_SAI_CLOCK_POLARITY_0) {
        return ARM_SAI_ERROR_CLOCK_POLARITY;
      }

      if (frame_len == 0U) {
        frame_len = slot_sz;
      } else {
        if (frame_len != slot_sz) {
          return ARM_SAI_ERROR_FRAME_LENGHT;
        }
      }

      bit_order        = ARM_SAI_MSB_FIRST;
      frame_sync_width = 1U;
      frame_sync_pol   = ARM_SAI_FRAME_SYNC_POLARITY_HIGH;
      frame_sync_early = true;
      slot_count       = 1U;
      slot_offset      = 0U;
      break;

    // PCM Long
    case ARM_SAI_PROTOCOL_PCM_LONG:
      if (stream->info->data_bits < 16U) {
        return ARM_SAI_ERROR_DATA_SIZE;
      }

      if (clock_pol != ARM_SAI_CLOCK_POLARITY_0) {
        return ARM_SAI_ERROR_CLOCK_POLARITY;
      }

      if (frame_len == 0U) {
        frame_len = slot_sz;
      } else {
        if (frame_len != slot_sz) {
          return ARM_SAI_ERROR_FRAME_LENGHT;
        }
      }

      bit_order        = ARM_SAI_MSB_FIRST;
      frame_sync_width = 13U;
      frame_sync_pol   = ARM_SAI_FRAME_SYNC_POLARITY_HIGH;
      frame_sync_early = false;
      slot_count       = 1U;
      slot_offset      = 0U;
      break;

    // AC97
    case ARM_SAI_PROTOCOL_AC97:

      // AC97 mode
      cr1 |= SAI_xCR1_PRTCFG_1;
      break;
    default: return ARM_SAI_ERROR_PROTOCOL;
  }

  // Frame Length
  frcr |= frame_len - 1U;

  // Bit Order
  if (bit_order == ARM_SAI_LSB_FIRST) { cr1 |= SAI_xCR1_LSBFIRST; }

  // Mono mode
  if (control & ARM_SAI_MONO_MODE)    { cr1 |= SAI_xCR1_MONO; }

  // Companding
  switch (control & ARM_SAI_COMPANDING_Msk) {
    case ARM_SAI_COMPANDING_NONE:                          break;
    case ARM_SAI_COMPANDING_U_LAW: cr2 |= SAI_xCR2_COMP_1; break;
    case ARM_SAI_COMPANDING_A_LAW: cr2 |= SAI_xCR2_COMP;   break;
    default: return ARM_SAI_ERROR_COMPANDING;
  }

  // Clock polarity
  if (clock_pol == ARM_SAI_CLOCK_POLARITY_0) { cr1 |= SAI_xCR1_CKSTR; }

  // Master clock pin
  switch (control & ARM_SAI_MCLK_PIN_Msk) {
    case ARM_SAI_MCLK_PIN_INACTIVE: 
      mclk_pin = 0U;
      break;
    case ARM_SAI_MCLK_PIN_OUTPUT:
      if ((master == 1U) && (stream->io.mclk != NULL)) {
        mclk_pin = 1U;
        break;
      }
    case ARM_SAI_MCLK_PIN_INPUT:
    default: return ARM_SAI_ERROR_MCLK_PIN;
  }

  // Frame Sync Width
  frcr |= (frame_sync_width - 1) << 8;

  // Frame sync polarity
  if (frame_sync_pol == ARM_SAI_FRAME_SYNC_POLARITY_HIGH) {
    frcr |= SAI_xFRCR_FSPO;
  }

  // Frame sync early
  if (frame_sync_early == true) { frcr |= SAI_xFRCR_FSOFF; }

  // Slot Count
  slotr |= (slot_count - 1) << 8;

  // Slot size
  if (slot_sz == 16) { slotr |= SAI_xSLOTR_SLOTSZ_0; }
  if (slot_sz == 32) { slotr |= SAI_xSLOTR_SLOTSZ_1; }

  // Slot offset
  slotr |= slot_offset;

  // Audio Frequency
  if (master == 1U) {
    // WS and SCK are generated only by master

    freq  = HAL_RCCEx_GetPeriphCLKFreq (sai->periph_clk);

    freq = (((freq * 10) / ((arg2 & ARM_SAI_AUDIO_FREQ_Msk) * 512)));
    val  = freq / 10;

    // Round result to the nearest integer
    if((freq % 10) > 8) { val += 1; }

    cr1 |= (val & 0x0F) << 20;

    if (mclk_pin == 1U) {
      // MCLK Prescaler
      val = (((arg2 & ARM_SAI_MCLK_PRESCALER_Msk) >> ARM_SAI_MCLK_PRESCALER_Pos) + 1U) / frame_len;
      if (val != 255U) {return ARM_SAI_ERROR_MCLK_PRESCALER;}
    }
  }

  // Configure registers
  cr2   |= (stream->reg->CR2 & SAI_xCR2_MUTE);
  slotr |= (stream->reg->SLOTR & SAI_xSLOTR_SLOTEN);

  if (stream->reg->CR1 & SAI_xCR1_SAIEN) {
    cr1 |= SAI_xCR1_SAIEN;
    // Disable SAI block
    stream->reg->CR1 &= ~SAI_xCR1_SAIEN;
  }

  stream->reg->CR2   = cr2;
  stream->reg->FRCR  = frcr;
  stream->reg->SLOTR = slotr;
  stream->reg->CR1   = cr1;

