xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
  sai->info->flags |= SAI_FLAG_CONFIGURED;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_SAI_STATUS SAI_GetStatus (SAI_RESOURCES *sai)
  \brief       Get SAI status.
  \param[in]   sai  Pointer to SAI resources
  \return      SAI status \ref ARM_SAI_STATUS
*/
static  ARM_SAI_STATUS SAI_GetStatus (SAI_RESOURCES *sai) {
  ARM_SAI_STATUS status;

  status.frame_error  = sai->info->status.frame_error;
  status.rx_busy      = sai->info->status.rx_busy;
  status.rx_overflow  = sai->info->status.rx_overflow;
  status.tx_busy      = sai->info->status.tx_busy;
  status.tx_underflow = sai->info->status.tx_underflow;

  return status;
}

/* SAI IRQ Handler */
void SAI_IRQHandler (SAI_RESOURCES *sai) {
  uint32_t     sr, data, event;
  SAI_STREAM  *stream;

  event = 0U;

  // Receive
  stream = sai->rx;
  if (stream->reg->CR1 & SAI_xCR1_SAIEN) {
    // SAI transmit blok is enabled

    // Read status register
    sr = stream->reg->SR;

    // FIFO request
    if (((sr & SAI_xSR_FREQ) != 0U) & (sai->info->status.rx_busy == 1U)) {
      while (stream->info->cnt != stream->info->num) {
        // Check is FIFO is empty
        if (((stream->reg->SR & SAI_xSR_FLVL) >> 16) == 0U) { break; }

        data = stream->reg->DR;

        // Put data into buffer
        *(stream->info->buf++) = (uint8_t)data;
        if (stream->info->data_bits > 8U) {
          *(stream->info->buf++) = (uint8_t)(data >> 8);
          if (stream->info->data_bits > 16U) {
            *(stream->info->buf++) = (uint8_t)(data >> 16);
            *(stream->info->buf++) = (uint8_t)(data >> 24);
          }
        }
        stream->info->cnt++;
      }

      if (stream->info->cnt == stream->info->num) {
        // Disable FIFO request interrupt
        stream->reg->IMR &= ~SAI_xIMR_FREQIE;

        // Clear busy flag
        sai->info->status.rx_busy = 0U;

        // Set event
        event |= ARM_SAI_EVENT_RECEIVE_COMPLETE;
      }
    }

    // Receive Overrun
    if (sr & SAI_xSR_OVRUDR) {
      // Set overflow flag
      sai->info->status.rx_overflow = 1U;

      // Clear interrupt flag
      stream->reg->CLRFR = SAI_xCLRFR_COVRUDR;

      // Set event
      event |= ARM_SAI_EVENT_RX_OVERFLOW;
    }

    // Late frame / anticipated frame synchronization detection
    if (sr & (SAI_xSR_AFSDET | SAI_xSR_LFSDET)) {

      // Only in slave mode
      if (stream->reg->CR1 & SAI_xCR1_MODE_1) {
        // Set error flag
        sai->info->status.frame_error = 1U;

        // Clear interrupt flag
        stream->reg->CLRFR = (SAI_xCLRFR_CLFSDET | SAI_xCLRFR_CAFSDET);

        // Set event
        event |= ARM_SAI_EVENT_FRAME_ERROR;
      }
    }
  }

  // Transmit
  stream = sai->tx;
  if (stream->reg->CR1 & SAI_xCR1_SAIEN) {
    // SAI transmit blok is enabled

    // Read status register
    sr = stream->reg->SR;

    // FIFO request
    if (((sr & SAI_xSR_FREQ) != 0U) & (sai->info->status.tx_busy == 1U)) {
      while (stream->info->cnt != stream->info->num) {
        // Check is FIFO is full
        if (((stream->reg->SR & SAI_xSR_FLVL) >> 16) == 5U) { break; }

        data = *(stream->info->buf++);
        if (stream->info->data_bits > 8U) {
          data |= *(stream->info->buf++) << 8;
          if (stream->info->data_bits > 16U) {
            data |= *(stream->info->buf++) << 16;
            data |= *(stream->info->buf++) << 24;
          }
        }
        // Write data to FIFO
        stream->reg->DR = data;
        stream->info->cnt++;
      }

      if (stream->info->cnt == stream->info->num) {
        // Disable FIFO request interrupt
        stream->reg->IMR &= ~SAI_xIMR_FREQIE;

        // Clear busy flag
        sai->info->status.tx_busy = 0U;

        // Set event
        event |= ARM_SAI_EVENT_SEND_COMPLETE;
      }
    }

    // Transmit Underrun
    if (sr & SAI_xSR_OVRUDR) {
      // Set underflow flag
      sai->info->status.tx_underflow = 1U;

      // Clear interrupt flag
      stream->reg->CLRFR = SAI_xCLRFR_COVRUDR;

      // Set event
      event |= ARM_SAI_EVENT_TX_UNDERFLOW;
    }

    // Late frame / anticipated frame synchronization detection
    if (sr & (SAI_xSR_AFSDET | SAI_xSR_LFSDET)) {

      // Only in slave mode
      if (stream->reg->CR1 & SAI_xCR1_MODE_1) {
        // Set error flag
        sai->info->status.frame_error = 1U;

        // Clear interrupt flag
        stream->reg->CLRFR = (SAI_xCLRFR_CLFSDET | SAI_xCLRFR_CAFSDET);

        // Set event
        event |= ARM_SAI_EVENT_FRAME_ERROR;
      }
    }
  }




  if ((event != 0U) && (sai->info->cb_event != NULL)) {
    sai->info->cb_event(event);
  }
}

/* SAI RX DMA Handler */
void SAI_RX_DMA_Complete (SAI_RESOURCES *sai) {

  if ((__HAL_DMA_GET_COUNTER(sai->rx->dma->hdma) != 0) && (sai->rx->info->num != 0)) {
    // RX DMA Complete caused by transfer abort
    return;
  }

  sai->rx->info->cnt = sai->rx->info->num;

  sai->info->status.rx_busy = 0U;
  if (sai->info->cb_event != NULL) {
    sai->info->cb_event(ARM_SAI_EVENT_RECEIVE_COMPLETE);
  }
}

/* SAI TX DMA Handler */
void SAI_TX_DMA_Complete (SAI_RESOURCES *sai) {

  if ((__HAL_DMA_GET_COUNTER(sai->tx->dma->hdma) != 0) && (sai->tx->info->num != 0)) {
    // TX DMA Complete caused by transfer abort
    return;
  }

  sai->tx->info->cnt = sai->tx->info->num;

  sai->info->status.tx_busy = 0U;
  if (sai->info->cb_event != NULL) {
    sai->info->cb_event(ARM_SAI_EVENT_SEND_COMPLETE);
  }
}


// SAI1
#ifdef MX_SAI1
static ARM_SAI_CAPABILITIES SAI1_GetCapabilities     (void)                                           { return SAI_GetCapabilities (&SAI1_Resources); }
static int32_t              SAI1_Initialize          (ARM_SAI_SignalEvent_t cb_event)                 { return SAI_Initialize (cb_event, &SAI1_Resources); }
static int32_t              SAI1_Uninitialize        (void)                                           { return SAI_Uninitialize (&SAI1_Resources); }
static int32_t              SAI1_PowerControl        (ARM_POWER_STATE state)                          { return SAI_PowerControl (state, &SAI1_Resources); }
static int32_t              SAI1_Send                (const void *data, uint32_t num)                 { return SAI_Send (data, num, &SAI1_Resources); }
static int32_t              SAI1_Receive             (      void *data, uint32_t num)                 { return SAI_Receive (data, num, &SAI1_Resources); }
static uint32_t             SAI1_GetTxCount          (void)                                           { return SAI_GetTxCount (&SAI1_Resources); }
static uint32_t             SAI1_GetRxCount          (void)                                           { return SAI_GetRxCount (&SAI1_Resources); }
static int32_t              SAI1_Control             (uint32_t control, uint32_t arg1, uint32_t arg2) { return SAI_Control (control, arg1, arg2, &SAI1_Resources); }
static ARM_SAI_STATUS       SAI1_GetStatus           (void)                                           { return SAI_GetStatus (&SAI1_Resources); }
       void                 SAI1_IRQHandler          (void)                                           {        SAI_IRQHandler (&SAI1_Resources); }

#ifdef MX_SAI1_A_DMA_Instance
void SAI1_A_DMA_Complete (DMA_HandleTypeDef *hdma) {
#if (SAI1_RX_BLOCK == SAI_BLOCK_A)
  SAI_RX_DMA_Complete (&SAI1_Resources);
#endif
#if (SAI1_TX_BLOCK == SAI_BLOCK_A)
  SAI_TX_DMA_Complete (&SAI1_Resources);
#endif
}

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SAI1_A_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SAI1_A_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_sai1_a);
}
#endif
#endif

