xpacks/stm32f7-cmsis/CMSIS/Driver/SAI_STM32F7xx.c
#ifdef MX_SAI1_B_DMA_Instance
void SAI1_B_DMA_Complete (DMA_HandleTypeDef *hdma) {
#if (SAI1_RX_BLOCK == SAI_BLOCK_B)
  SAI_RX_DMA_Complete (&SAI1_Resources);
#endif
#if (SAI1_TX_BLOCK == SAI_BLOCK_B)
  SAI_TX_DMA_Complete (&SAI1_Resources);
#endif
}

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SAI1_B_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SAI1_B_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_sai1_b);
}
#endif
#endif


// SAI1 Driver Control Block
ARM_DRIVER_SAI Driver_SAI1 = {
    SAI_GetVersion,
    SAI1_GetCapabilities,
    SAI1_Initialize,
    SAI1_Uninitialize,
    SAI1_PowerControl,
    SAI1_Send,
    SAI1_Receive,
    SAI1_GetTxCount,
    SAI1_GetRxCount,
    SAI1_Control,
    SAI1_GetStatus
};
#endif /* MX_SAI1 */

// SAI2
#ifdef MX_SAI2
static ARM_SAI_CAPABILITIES SAI2_GetCapabilities     (void)                                           { return SAI_GetCapabilities (&SAI2_Resources); }
static int32_t              SAI2_Initialize          (ARM_SAI_SignalEvent_t cb_event)                 { return SAI_Initialize (cb_event, &SAI2_Resources); }
static int32_t              SAI2_Uninitialize        (void)                                           { return SAI_Uninitialize (&SAI2_Resources); }
static int32_t              SAI2_PowerControl        (ARM_POWER_STATE state)                          { return SAI_PowerControl (state, &SAI2_Resources); }
static int32_t              SAI2_Send                (const void *data, uint32_t num)                 { return SAI_Send (data, num, &SAI2_Resources); }
static int32_t              SAI2_Receive             (      void *data, uint32_t num)                 { return SAI_Receive (data, num, &SAI2_Resources); }
static uint32_t             SAI2_GetTxCount          (void)                                           { return SAI_GetTxCount (&SAI2_Resources); }
static uint32_t             SAI2_GetRxCount          (void)                                           { return SAI_GetRxCount (&SAI2_Resources); }
static int32_t              SAI2_Control             (uint32_t control, uint32_t arg1, uint32_t arg2) { return SAI_Control (control, arg1, arg2, &SAI2_Resources); }
static ARM_SAI_STATUS       SAI2_GetStatus           (void)                                           { return SAI_GetStatus (&SAI2_Resources); }
       void                 SAI2_IRQHandler          (void)                                           {        SAI_IRQHandler (&SAI2_Resources); }

#ifdef MX_SAI2_A_DMA_Instance
void SAI2_A_DMA_Complete (DMA_HandleTypeDef *hdma) {
#if (SAI2_RX_BLOCK == SAI_BLOCK_A)
  SAI_RX_DMA_Complete (&SAI2_Resources);
#endif
#if (SAI2_TX_BLOCK == SAI_BLOCK_A)
  SAI_TX_DMA_Complete (&SAI2_Resources);
#endif
}

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SAI2_A_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SAI2_A_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_sai2_a);
}
#endif
#endif

#ifdef MX_SAI2_B_DMA_Instance
void SAI2_B_DMA_Complete (DMA_HandleTypeDef *hdma) {
#if (SAI2_RX_BLOCK == SAI_BLOCK_B)
  SAI_RX_DMA_Complete (&SAI2_Resources);
#endif
#if (SAI2_TX_BLOCK == SAI_BLOCK_B)
  SAI_TX_DMA_Complete (&SAI2_Resources);
#endif
}

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SAI2_B_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SAI2_B_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_sai2_b);
}
#endif
#endif


// SAI2 Driver Control Block
ARM_DRIVER_SAI Driver_SAI2 = {
    SAI_GetVersion,
    SAI2_GetCapabilities,
    SAI2_Initialize,
    SAI2_Uninitialize,
    SAI2_PowerControl,
    SAI2_Send,
    SAI2_Receive,
    SAI2_GetTxCount,
    SAI2_GetRxCount,
    SAI2_Control,
    SAI2_GetStatus
};
#endif /* MX_SAI2 */
